In [1]:
import yaml
import pandas as pd

try:
    with open("../../config.yaml", "r") as file:
        config = yaml.safe_load(file)

    df_full_clean = pd.read_csv(config['data']['clean_data']['full_clean'], sep=";")

except:
    print("Yaml configuration file not found!")

In [2]:
df_full_clean

,airline,flight,from,to,duration,stops,class,lead_time_days,price
0,SpiceJet,SG-8709,Delhi,Mumbai,2h 17m,0,Economy,1,5953
1,SpiceJet,SG-8157,Delhi,Mumbai,2h 33m,0,Economy,1,5953
2,AirAsia,I5-764,Delhi,Mumbai,2h 17m,0,Economy,1,5956
3,Vistara,UK-995,Delhi,Mumbai,2h 25m,0,Economy,1,5955
4,Vistara,UK-963,Delhi,Mumbai,2h 33m,0,Economy,1,5955
...,...,...,...,...,...,...,...,...,...
300148,Vistara,UK-822,Chennai,Hyderabad,10h 08m,1,Business,49,69265
300149,Vistara,UK-826,Chennai,Hyderabad,10h 42m,1,Business,49,77105
300150,Vistara,UK-832,Chennai,Hyderabad,13h 83m,1,Business,49,79099
300151,Vistara,UK-828,Chennai,Hyderabad,10h 00m,1,Business,49,81585
300152,Vistara,UK-822,Chennai,Hyderabad,10h 08m,1,Business,49,81585

In [3]:
# Get unique origin name
origin_df = pd.DataFrame({"origin_id": range(1, df_full_clean["from"].nunique() + 1),
                               "origin": df_full_clean["from"].drop_duplicates().reset_index(drop=True)})

In [4]:
origin_df

   origin_id     origin
0          1      Delhi
1          2     Mumbai
2          3  Bangalore
3          4    Kolkata
4          5  Hyderabad
5          6    Chennai

In [5]:
origin_df.to_csv(config['data']['sql']['origin'], index=False, encoding="utf-8")